&НаСервереБезКонтекста
Функция ПодключитьОбработку(Знач ИмяФайла)
	
	ИмяФайла = Константы.ТестируемаяОбработка.Получить();
	
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		ВызватьИсключение "Файл внешней обработки не найден";
	КонецЕсли;
	
	ОписаниеЗащиты = Новый ОписаниеЗащитыОтОпасныхДействий;
	ОписаниеЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
	// BSLLS:UsingExternalCodeTools-off
	Обработка = ВнешниеОбработки.Создать(ИмяФайла, Ложь, ОписаниеЗащиты);
	Возврат "ВнешняяОбработка." + Обработка.Метаданные().Имя + ".Форма";
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПараметрыФормы()
	
	ИмяФайлаБиблиотеки = Константы.ТестируемаяБиблиотека.Получить();
	Возврат Новый Структура("AddInURL", ИмяФайлаБиблиотеки);
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Истина;
	ИмяНовойФормы = ПодключитьОбработку(ПараметрЗапуска);
	ОткрытьФорму(ИмяНовойФормы, ПолучитьПараметрыФормы());
	
КонецПроцедуры
