&НаСервере
Перем ВК, Лог;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для каждого ЭлементСписка из СписокУзлов Цикл
		Элементы.Результаты.Развернуть(ЭлементСписка.Значение, Истина);
	КонецЦикла;
	СписокУзлов.Очистить();
	
//	ПодключитьОбработчикОжидания("ЗавершитьРаботу", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботу()
	
	ЗавершитьРаботуСистемы(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ФайлОбработки = Новый Файл(ОбработкаОбъект.ИспользуемоеИмяФайла);
	ТекущийКаталог = ФайлОбработки.Путь;
	
	ИдКомпоненты = "_" + StrReplace(New UUID, "-", "");
	МакетКомпоненты = ОбработкаОбъект.ПолучитьМакет("VanessaExt");
	АдресКомпоненты = ПоместитьВоВременноеХранилище(МакетКомпоненты, УникальныйИдентификатор);
	ПодключитьВнешнююКомпоненту(АдресКомпоненты, ИдКомпоненты, ТипВнешнейКомпоненты.Native);
	ВК = Новый("AddIn." + ИдКомпоненты + ".WindowsControl");
	
	ВыполнитьТесты();
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьСтрокуJSON(ТекстJSON)
	
	Если ПустаяСтрока(ТекстJSON) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПоляДаты = Новый Массив;
	ПоляДаты.Добавить("CreationDate");
	ПоляДаты.Добавить("date");
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	Возврат ПрочитатьJSON(ЧтениеJSON, , ПоляДаты);
	
КонецФункции

&НаСервере
Функция ДобавитьГруппуТестов(Наименование)
	
	Стр = Результаты.ПолучитьЭлементы().Добавить();
	СписокУзлов.Добавить(Стр.ПолучитьИдентификатор());
	Стр.Наименование = Наименование;
	Возврат Стр;

КонецФункции

&НаСервере
Функция ТестВычислить(Группа, ИмяТеста, Выражение)
	
	Стр = Группа.ПолучитьЭлементы().Добавить();
	Стр.Наименование = ИмяТеста;
	Стр.Выражение = Выражение;
	Попытка
		Значение = Вычислить(Выражение);
		Стр.Результат = Значение;
		Стр.Подробности = Значение;
	Исключение
		Значение = Неопределено;
		Информация = ИнформацияОбОшибке();
		Стр.Результат = КраткоеПредставлениеОшибки(Информация);
		Стр.Подробности = ПодробноеПредставлениеОшибки(Информация);
		Стр.Ошибка = Истина;
		Группа.Ошибка = Истина;
	КонецПопытки;
	
	Возврат Значение;
	
КонецФункции

&НаСервере
Процедура ТестВыполнить(Группа, ИмяТеста, Выражение)
	
	Стр = Группа.ПолучитьЭлементы().Добавить();
	Стр.Наименование = ИмяТеста;
	Стр.Выражение = Выражение;
	Попытка
		Выполнить(Выражение);
	Исключение
		Значение = Неопределено;
		Информация = ИнформацияОбОшибке();
		Стр.Результат = КраткоеПредставлениеОшибки(Информация);
		Стр.Подробности = ПодробноеПредставлениеОшибки(Информация);
		Стр.Ошибка = Истина;
		Группа.Ошибка = Истина;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьТесты()
	
	Группа = ДобавитьГруппуТестов("Свойства компоненты");
	ТестВычислить(Группа, "Получить:Version", "ВК.Version");
	ТестВычислить(Группа, "Получить:Версия", "ВК.Версия");
	ТестВычислить(Группа, "Получить:ВЕРСИЯ", "ВК.ВЕРСИЯ");
	ТестВычислить(Группа, "Получить:ProcessId", "ВК.ProcessId");
	ТестВычислить(Группа, "ИдентификаторПроцесса", "ВК.ИдентификаторПроцесса");
	ТестВыполнить(Группа, "Установить:ТекстБуфераОбмена", "ВК.ТекстБуфераОбмена = ""ТекстБуфераОбмена""");
	ТестВычислить(Группа, "Получить:ТекстБуфераОбмена", "ВК.ТекстБуфераОбмена");
	ТестВыполнить(Группа, "Проверка генерации рошибки", "ВК.Проверка = ""Тест""");
	
	Группа = ДобавитьГруппуТестов("Методы компоненты");
	ТестВычислить(Группа, "ПолучитьСписокОкон()", "ВК.ПолучитьСписокОкон(ВК.ИдентификаторПроцесса)");
	
КонецПроцедуры